In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('data/title_budgets_ratings_v2.csv')

In [3]:
df.head()

,Unnamed: 0,id,release_date,movie,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,year,month,production_budget_2,domestic_gross_2,worldwide_gross_2,genres2,profit
0,0,1,2009-12-18,Avatar,tt1775309,Avatar,Abatâ,2011,93.0,Horror,6.1,43,2009,12,425000000,760507625,2776345279,['Horror'],5.532577
1,1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,tt1298650,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy",6.6,447624,2011,5,410600000,241063875,1045663875,"['Action', 'Adventure', 'Fantasy']",1.546673
2,2,3,2019-06-07,Dark Phoenix,tt6565702,Dark Phoenix,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi",6.0,24451,2019,6,350000000,42762350,149762350,"['Action', 'Adventure', 'Sci-Fi']",-0.572108
3,3,4,2015-05-01,Avengers: Age of Ultron,tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi",7.3,665594,2015,5,330600000,459005868,1403013963,"['Action', 'Adventure', 'Sci-Fi']",3.243841
4,4,7,2018-04-27,Avengers: Infinity War,tt4154756,Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi",8.5,670926,2018,4,300000000,678815482,2048134200,"['Action', 'Adventure', 'Sci-Fi']",5.827114

In [4]:
df.shape

(2943, 19)

df.isna().sum()

In [7]:
df.loc[df['genres'].isna()]

,Unnamed: 0,id,release_date,movie,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,year,month,production_budget_2,domestic_gross_2,worldwide_gross_2,genres2,profit
30,30,39,2010-05-14,Robin Hood,tt6858500,Robin Hood,Robin Hood,2018,NaN,NaN,7.6,5,2010,5,210000000,105487148,322459006,NaN,0.535519
272,272,9,2018-11-21,Robin Hood,tt6858500,Robin Hood,Robin Hood,2018,NaN,NaN,7.6,5,2018,11,99000000,30824628,84747441,NaN,-0.143965
489,489,88,2015-12-25,Joy,tt2495188,Joy,Hara,2012,80.0,NaN,5.8,28,2015,12,60000000,56451232,101134059,NaN,0.685568
667,667,73,2010-03-19,The Bounty Hunter,tt1472211,The Bounty Hunter,The Bounty Hunter,2010,NaN,NaN,6.3,29,2010,3,45000000,67061228,135808837,NaN,2.017974
728,728,6,2015-09-25,The Intern,tt1636456,The Intern,El pasante,2010,65.0,NaN,5.5,22,2015,9,40000000,75764672,197115710,NaN,3.927893
929,929,11,2010-09-03,Going the Distance,tt6135412,Going the Distance,Kazoku e,2016,117.0,NaN,3.9,13,2010,9,32000000,17804299,43603990,NaN,0.362625
1796,1796,85,2016-09-09,When the Bough Breaks,tt6814096,When the Bough Breaks,When the Bough Breaks,2017,93.0,NaN,6.1,8,2016,9,10000000,29747603,30768449,NaN,2.076845
2859,2859,21,2015-06-19,The Overnight,tt0326592,The Overnight,The Overnight,2010,88.0,NaN,7.5,24,2015,6,200000,1109808,1165996,NaN,4.829980

We won't drop columns that have NaNs in runtime_minutes because some big productions, such as Titanic, does not have a value either!

In [9]:
df.loc[df['movie']== 'Titanic']

,Unnamed: 0,id,release_date,movie,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,year,month,production_budget_2,domestic_gross_2,worldwide_gross_2,genres2,profit
32,32,43,1997-12-19,Titanic,tt2495766,Titanic,Titanic,2012,NaN,Adventure,6.2,20,1997,12,200000000,659363944,2208208395,['Adventure'],10.041042